#+TITLE: LabBook
#+AUTHOR: Anderson Mattheus Maliszewski
#+STARTUP: overview indent
#+TAGS: noexport(n) deprecated(d) 
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

This LabBook is for the *Scientific Methodology and Performance
Evaluation for Experimental Computer* class, in which informations
about the experimental procedure are described.

*** Read CSV
#+begin_src R :results output :session *R* :exports both
library("tidyverse")
df <- read.csv("LOGS/npb.02-11-2019.21h37m51s.csv")
 df$kernel=toupper(df$kernel) 
    
    df %>%
      group_by(kernel,interface) %>%
      summarise(
        mean=mean(time),
        sd=sd(time),
        se=sd/sqrt(n()),
        N=n()) %>%
      arrange(kernel,interface) -> newdf
    newdf
#+end_src

#+RESULTS:
#+begin_example
── [1mAttaching packages[22m ─────────────────────────────────────── tidyverse 1.2.1 ──
[32m✔[39m [34mggplot2[39m 3.2.1     [32m✔[39m [34mpurrr  [39m 0.3.2
[32m✔[39m [34mtibble [39m 2.1.3     [32m✔[39m [34mdplyr  [39m 0.8.3
[32m✔[39m [34mtidyr  [39m 1.0.0     [32m✔[39m [34mstringr[39m 1.4.0
[32m✔[39m [34mreadr  [39m 1.3.1     [32m✔[39m [34mforcats[39m 0.4.0
── [1mConflicts[22m ────────────────────────────────────────── tidyverse_conflicts() ──
[31m✖[39m [34mdplyr[39m::[32mfilter()[39m masks [34mstats[39m::filter()
[31m✖[39m [34mdplyr[39m::[32mlag()[39m    masks [34mstats[39m::lag()

[90m# A tibble: 24 x 6[39m
[90m# Groups:   kernel [8][39m
   kernel interface   mean     sd     se     N
   [3m[90m<chr>[39m[23m  [3m[90m<fct>[39m[23m      [3m[90m<dbl>[39m[23m  [3m[90m<dbl>[39m[23m  [3m[90m<dbl>[39m[23m [3m[90m<int>[39m[23m
[90m 1[39m BT     ETH        558.   2.01  0.366     30
[90m 2[39m BT     IB         414.   1.22  0.222     30
[90m 3[39m BT     IPoIB      690.  10.5   1.92      30
[90m 4[39m CG     ETH        771.   3.49  0.637     30
[90m 5[39m CG     IB         184.   1.97  0.360     30
[90m 6[39m CG     IPoIB      182.   2.44  0.445     30
[90m 7[39m EP     ETH         37.5  1.14  0.209     30
[90m 8[39m EP     IB          37.3  0.222 0.040[4m6[24m    30
[90m 9[39m EP     IPoIB       38.2  1.91  0.349     30
[90m10[39m FT     ETH       [4m1[24m584.   0.726 0.132     30
[90m# … with 14 more rows[39m
#+end_example
